#include <stdio.h>
#include <math.h>
#include <locale.h>
#include "modul.h"
/* Автор: Галкин Р.Р.
 * Задача
 * Дана поседовательность натуральных чисел. Нужно найти длину максимального отрезка
 * идущих подряд совершенных чисел.
 * (Совершенное число - число сумма делителей которого равна этому числу.
 * Например: делители 6: 1,2,3 в сумме дают 6; делители 28: 1,2,4,7,14 в сумме 28)
 */

int main() {

setlocale(LC_ALL, "Russian");

unsigned int o = 0,k = 0; // Для подсчёта наибольшей длины отрезка. o - промежуточный, k - итоговый ответ
unsigned int n;


printf("Введите число n\n");
scanf("%u",&n);

int chis[n];

VvodMasInt("Вводите целые числа",chis,"Число ",n);

for (int i = 0; i<n; i++){      //Поиск длин отрезков 
    if (isPerfNum(chis[i])){
        o++;
        if (k<o){
            k = o;
        }
    }
    else{      
        o = 0;
    }
}

printf("Наибольшая длина отрезка = %u",k);

while (getchar()!='\n');
getchar();

return 0;
}